# 연습: DataFrame 1

In [1]:
#판다스를 가져오기
import pandas as pd
import numpy as np

### 예제 1 
1. Nan이 아닌 부분을 출력하시오.
2. NaN의 값을 0으로 바꾼후 출력하시오.

In [5]:
sdata = {'Ohio': 35000,
         'Texas': 71000,
         'Oregon': 16000,
         'Utah': 5000}

states = ['California', 'Ohio', 'Oregon', 'Texas'] #california is not in sdata
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [7]:
# 예제 1.1
obj4[obj4.isna()==False]

Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

In [ ]:
obj4[obj4.notnull()]

In [15]:
help(pd.DataFrame.fillna)

Help on function fillna in module pandas.core.generic:

fillna(self, value: 'Hashable | Mapping | Series | DataFrame | None' = None, *, method: 'FillnaOptions | None' = None, axis: 'Axis | None' = None, inplace: 'bool_t' = False, limit: 'int | None' = None, downcast: 'dict | None | lib.NoDefault' = <no_default>) -> 'Self | None'
    Fill NA/NaN values using the specified method.

    Parameters
    ----------
    value : scalar, dict, Series, or DataFrame
        Value to use to fill holes (e.g. 0), alternately a
        dict/Series/DataFrame of values specifying which value to use for
        each index (for a Series) or column (for a DataFrame).  Values not
        in the dict/Series/DataFrame will not be filled. This value cannot
        be a list.
    method : {'backfill', 'bfill', 'ffill', None}, default None
        Method to use for filling holes in reindexed Series:

        * ffill: propagate last valid observation forward to next valid.
        * backfill / bfill: use next valid observation to fill gap.

        .. deprecated:: 2.1.0
            Use ffill or bfill instead.

    axis : {0 or 'index'} for Series, {0 or 'index', 1 or 'columns'} for DataFrame
        Axis along which to fill missing values. For `Series`
        this parameter is unused and defaults to 0.
    inplace : bool, default False
        If True, fill in-place. Note: this will modify any
        other views on this object (e.g., a no-copy slice for a column in a
        DataFrame).
    limit : int, default None
        If method is specified, this is the maximum number of consecutive
        NaN values to forward/backward fill. In other words, if there is
        a gap with more than this number of consecutive NaNs, it will only
        be partially filled. If method is not specified, this is the
        maximum number of entries along the entire axis where NaNs will be
        filled. Must be greater than 0 if not None.
    downcast : dict, default is None
        A dict of item->dtype of what to downcast if possible,
        or the string 'infer' which will try to downcast to an appropriate
        equal type (e.g. float64 to int64 if possible).

        .. deprecated:: 2.2.0

    Returns
    -------
    Series/DataFrame or None
        Object with missing values filled or None if ``inplace=True``.

    See Also
    --------
    ffill : Fill values by propagating the last valid observation to next valid.
    bfill : Fill values by using the next valid observation to fill the gap.
    interpolate : Fill NaN values using interpolation.
    reindex : Conform object to new index.
    asfreq : Convert TimeSeries to specified frequency.

    Examples
    --------
    >>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],
    ...                    [3, 4, np.nan, 1],
    ...                    [np.nan, np.nan, np.nan, np.nan],
    ...                    [np.nan, 3, np.nan, 4]],
    ...                   columns=list("ABCD"))
    >>> df
         A    B   C    D
    0  NaN  2.0 NaN  0.0
    1  3.0  4.0 NaN  1.0
    2  NaN  NaN NaN  NaN
    3  NaN  3.0 NaN  4.0

    Replace all NaN elements with 0s.

    >>> df.fillna(0)
         A    B    C    D
    0  0.0  2.0  0.0  0.0
    1  3.0  4.0  0.0  1.0
    2  0.0  0.0  0.0  0.0
    3  0.0  3.0  0.0  4.0

    Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1,
    2, and 3 respectively.

    >>> values = {"A": 0, "B": 1, "C": 2, "D": 3}
    >>> df.fillna(value=values)
         A    B    C    D
    0  0.0  2.0  2.0  0.0
    1  3.0  4.0  2.0  1.0
    2  0.0  1.0  2.0  3.0
    3  0.0  3.0  2.0  4.0

    Only replace the first NaN element.

    >>> df.fillna(value=values, limit=1)
         A    B    C    D
    0  0.0  2.0  2.0  0.0
    1  3.0  4.0  NaN  1.0
    2  NaN  1.0  NaN  3.0
    3  NaN  3.0  NaN  4.0

    When filling using a DataFrame, replacement happens along
    the same column names and same indices

    >>> df2 = pd.DataFrame(np.zeros((4, 4)), columns=list("ABCE"))
    >>> df.fillna(df2)
         A    B    C    D
    0  0.0  2.0  0.0  0.0
    1  3.0  4.0  0.0  1.0
    2  0.0  0.0  0.0  NaN
    3  0.0  3.0  0.0  4.0

    Note that column D is not affected since it is not present in df2.

In [17]:
# 예제 1.2
obj4 = obj4.fillna(0)
obj4

California        0.0
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### 예제 2

index가 'four'인 행의 값을 [1999, 'Ohio', 3.2, 0]으로 변경하시오.

`columns=['year', 'state', 'pop', 'debt']`

In [26]:
data = {
    'year': [2020, 2021, 2022, 2023, 2024],
    'state': ['California', 'Texas', 'Florida', 'New York', 'Illinois'],
    'pop': [39538223, 29145505, 21538187, 20201249, 12812508],
    'debt': [np.nan, np.nan, np.nan, np.nan, np.nan]  # debt 열은 NaN으로 채움
}

In [28]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], #debt는 없으므로 NaN으로 채움
                   index=['one', 'two', 'three', 'four', 'five']) #index를 지정해줌

frame

       year       state       pop  debt
one    2020  California  39538223   NaN
two    2021       Texas  29145505   NaN
three  2022     Florida  21538187   NaN
four   2023    New York  20201249   NaN
five   2024    Illinois  12812508   NaN

In [30]:
# 예제 2
frame.loc['four'] = [1999, 'Ohio', 3.2, 0]
frame

C:\Users\jisu\AppData\Local\Temp\ipykernel_18548\523579201.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '3.2' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  frame.loc['four'] = [1999, 'Ohio', 3.2, 0]

       year       state         pop  debt
one    2020  California  39538223.0   NaN
two    2021       Texas  29145505.0   NaN
three  2022     Florida  21538187.0   NaN
four   1999        Ohio         3.2   0.0
five   2024    Illinois  12812508.0   NaN

### 예제 3
위 frame에서 index가 two, column이 state 인 값을 'Nevada'로 변경하시오.

In [32]:
# 예제 3
frame.loc['two','state'] = 'Nevada'
frame

       year       state         pop  debt
one    2020  California  39538223.0   NaN
two    2021      Nevada  29145505.0   NaN
three  2022     Florida  21538187.0   NaN
four   1999        Ohio         3.2   0.0
five   2024    Illinois  12812508.0   NaN

### 예제 4 
위 frame에 year=2002이고 state='Ohio' 일때 True를 갖는 etc 컬럼을 생성하시오.

In [36]:
frame['etc'] = np.where((frame['year'] == 2002) & (frame['state'] == 'Ohio'), True, False)
frame

       year       state         pop  debt    etc
one    2020  California  39538223.0   NaN  False
two    2021      Nevada  29145505.0   NaN  False
three  2022     Florida  21538187.0   NaN  False
four   1999        Ohio         3.2   0.0  False
five   2024    Illinois  12812508.0   NaN  False

In [ ]:
frame['etc'] = False  # 모든 값을 False로 초기화
frame.loc[(frame['year'] == 2022) & (frame['state'] == 'Florida'), 'etc'] = True

### 예제 5 
1. 위 frame에서 one, three, four 행에서 year, state, etc 열만 가져와 frame2에 저장하시오.
2. 수정된 frame2에서 year > 2000, state == Ohio 인 행을 출력 하시오.

In [42]:
# 예제 5.1

frame2 = frame.loc[['one','three','four'],['year','state','etc']]
frame2

       year       state    etc
one    2020  California  False
three  2022     Florida  False
four   1999        Ohio  False

In [54]:
frame2[(frame2['year'] > 2000) & (frame2['state'] == 'Ohio')]

Empty DataFrame
Columns: [year, state, etc]
Index: []

### 예제 6 
데이터 프레임의 각 행과 열의 합을 각각 계산하여 출력하시오.

In [48]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), #bde 열을 생성
                  index=['Utah', 'Ohio', 'Texas', 'Oregon']) #Utah, Ohio, Texas, Oregon 행을 생성
frame

               b         d         e
Utah    1.196106  1.004613  0.635318
Ohio   -2.693137 -1.406024 -0.313458
Texas  -0.743472  3.331856 -0.969965
Oregon  0.944918  0.460195  0.079653

In [56]:
# 예제 6:열의 합
frame.sum()

b   -1.295586
d    3.390640
e   -0.568452
dtype: float64

In [58]:
# 예제 6: 행의 합
frame.sum(axis=1)

Utah      2.836036
Ohio     -4.412620
Texas     1.618419
Oregon    1.484766
dtype: float64

### 예제 7
아래 int_frame을 index, column기준으로 정렬하시오. (단, index, column 모두 정렬되어야 함)<br>

In [52]:
int_frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'b', 'c', 'a']) #column 기준 정렬
int_frame

       d  b  c  a
three  0  1  2  3
one    4  5  6  7

In [60]:
# 예제 7
int_frame.sort_index()

       d  b  c  a
one    4  5  6  7
three  0  1  2  3

In [62]:
int_frame.sort_values(by='b')

       d  b  c  a
three  0  1  2  3
one    4  5  6  7

### 예제 8
코스피와 IBM 가격정보를 불러와 상관관계를 파악하시오.
- 코스피 = '^KS11'
- IBM = 'IBM'
- 애플 = 'APLE'

# 주가 데이터를 불러올 티커 목록
tickers = ['^KS11', 'IBM', 'AAPL', 'GOOGL', 'MSFT', 'TSLA']  # AAPL: 애플, GOOGL: 구글, MSFT: 마이크로소프트, TSLA: 테슬라

## pandas_datareader
- 금융, 경제 데이터를 손쉽게 가져올 수 있도록 도와주는 Python 라이브러리

```python
!pip install pandas_datareader

import pandas_datareader as pdr
```

## yfinance
- Yahoo Finance 데이터를 쉽게 가져와 분석할 수 있도록 도와주는 Python 라이브러리

```python
!pip install yfinance

import yfinance as yf
```

In [1]:
!pip install yfinance
!pip install pandas_datareader

import yfinance as yf
import pandas_datareader as pdr

Requirement already satisfied: yfinance in c:\users\jisu\anaconda3\lib\site-packages (0.2.46)
Requirement already satisfied: pandas>=1.3.0 in c:\users\jisu\anaconda3\lib\site-packages (from yfinance) (2.2.2)
Requirement already satisfied: numpy>=1.16.5 in c:\users\jisu\anaconda3\lib\site-packages (from yfinance) (1.26.4)
Requirement already satisfied: requests>=2.31 in c:\users\jisu\anaconda3\lib\site-packages (from yfinance) (2.32.2)
Requirement already satisfied: multitasking>=0.0.7 in c:\users\jisu\anaconda3\lib\site-packages (from yfinance) (0.0.11)
Requirement already satisfied: lxml>=4.9.1 in c:\users\jisu\anaconda3\lib\site-packages (from yfinance) (5.2.1)
Requirement already satisfied: platformdirs>=2.0.0 in c:\users\jisu\anaconda3\lib\site-packages (from yfinance) (3.10.0)
Requirement already satisfied: pytz>=2022.5 in c:\users\jisu\anaconda3\lib\site-packages (from yfinance) (2024.1)
Requirement already satisfied: frozendict>=2.3.4 in c:\users\jisu\anaconda3\lib\site-packages (from yfinance) (2.4.2)
Requirement already satisfied: peewee>=3.16.2 in c:\users\jisu\anaconda3\lib\site-packages (from yfinance) (3.17.7)
Requirement already satisfied: beautifulsoup4>=4.11.1 in c:\users\jisu\anaconda3\lib\site-packages (from yfinance) (4.12.3)
Requirement already satisfied: html5lib>=1.1 in c:\users\jisu\anaconda3\lib\site-packages (from yfinance) (1.1)
Requirement already satisfied: soupsieve>1.2 in c:\users\jisu\anaconda3\lib\site-packages (from beautifulsoup4>=4.11.1->yfinance) (2.5)
Requirement already satisfied: six>=1.9 in c:\users\jisu\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (1.16.0)
Requirement already satisfied: webencodings in c:\users\jisu\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (0.5.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\jisu\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in c:\users\jisu\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2023.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\jisu\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\jisu\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\jisu\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2.2.2)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\jisu\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2024.8.30)
Requirement already satisfied: pandas_datareader in c:\users\jisu\anaconda3\lib\site-packages (0.10.0)
Requirement already satisfied: lxml in c:\users\jisu\anaconda3\lib\site-packages (from pandas_datareader) (5.2.1)
Requirement already satisfied: pandas>=0.23 in c:\users\jisu\anaconda3\lib\site-packages (from pandas_datareader) (2.2.2)
Requirement already satisfied: requests>=2.19.0 in c:\users\jisu\anaconda3\lib\site-packages (from pandas_datareader) (2.32.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\jisu\anaconda3\lib\site-packages (from pandas>=0.23->pandas_datareader) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\jisu\anaconda3\lib\site-packages (from pandas>=0.23->pandas_datareader) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\jisu\anaconda3\lib\site-packages (from pandas>=0.23->pandas_datareader) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\jisu\anaconda3\lib\site-packages (from pandas>=0.23->pandas_datareader) (2023.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\jisu\anaconda3\lib\site-packages (from requests>=2.19.0->pandas_datareader) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\jisu\anaconda3\lib\site-packages (from requests>=2.19.0->pandas_datareader) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\jisu\anaconda3\lib\site-packages (from requests>=2.19.0->pandas_datareader) (2.2.2)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\jisu\anaconda3\lib\site-packages (from requests>=2.19.0->pandas_datareader) (2024.8.30)
Requirement already satisfied: six>=1.5 in c:\users\jisu\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas>=0.23->pandas_datareader) (1.16.0)

In [15]:
!pip show yfinance

Name: yfinance
Version: 0.2.46
Summary: Download market data from Yahoo! Finance API
Home-page: https://github.com/ranaroussi/yfinance
Author: Ran Aroussi
Author-email: ran@aroussi.com
License: Apache
Location: C:\Users\jisu\anaconda3\Lib\site-packages
Requires: beautifulsoup4, frozendict, html5lib, lxml, multitasking, numpy, pandas, peewee, platformdirs, pytz, requests
Required-by:

In [17]:
tickers = ['^KS11', 'IBM', 'AAPL', 'GOOGL', 'MSFT', 'TSLA']
all_data = {}

# Yahoo Finance 데이터를 가져옴
for ticker in tickers:
    #all_data[ticker] = yf.download(ticker)
    data_temp = yf.download(ticker)
    print (data_temp.columns)
    
    if not data_temp.empty :
        data_temp.columns = data_temp.columns.droplevel(1)
        all_data[ticker] = data_temp
all_data

[*********************100%***********************]  1 of 1 completed

MultiIndex([('Adj Close', '^KS11'),
            (    'Close', '^KS11'),
            (     'High', '^KS11'),
            (      'Low', '^KS11'),
            (     'Open', '^KS11'),
            (   'Volume', '^KS11')],
           names=['Price', 'Ticker'])

[*********************100%***********************]  1 of 1 completed

MultiIndex([('Adj Close', 'IBM'),
            (    'Close', 'IBM'),
            (     'High', 'IBM'),
            (      'Low', 'IBM'),
            (     'Open', 'IBM'),
            (   'Volume', 'IBM')],
           names=['Price', 'Ticker'])

[*********************100%***********************]  1 of 1 completed

MultiIndex([('Adj Close', 'AAPL'),
            (    'Close', 'AAPL'),
            (     'High', 'AAPL'),
            (      'Low', 'AAPL'),
            (     'Open', 'AAPL'),
            (   'Volume', 'AAPL')],
           names=['Price', 'Ticker'])

[*********************100%***********************]  1 of 1 completed

MultiIndex([('Adj Close', 'GOOGL'),
            (    'Close', 'GOOGL'),
            (     'High', 'GOOGL'),
            (      'Low', 'GOOGL'),
            (     'Open', 'GOOGL'),
            (   'Volume', 'GOOGL')],
           names=['Price', 'Ticker'])

[*********************100%***********************]  1 of 1 completed

MultiIndex([('Adj Close', 'MSFT'),
            (    'Close', 'MSFT'),
            (     'High', 'MSFT'),
            (      'Low', 'MSFT'),
            (     'Open', 'MSFT'),
            (   'Volume', 'MSFT')],
           names=['Price', 'Ticker'])

[*********************100%***********************]  1 of 1 completed

MultiIndex([('Adj Close', 'TSLA'),
            (    'Close', 'TSLA'),
            (     'High', 'TSLA'),
            (      'Low', 'TSLA'),
            (     'Open', 'TSLA'),
            (   'Volume', 'TSLA')],
           names=['Price', 'Ticker'])

{'^KS11': Price                        Adj Close        Close         High          Low  \
 Date
 1996-12-11 00:00:00+00:00   704.679993   704.679993   709.479980   704.429993
 1996-12-12 00:00:00+00:00   689.380005   689.380005   706.010010   688.739990
 1996-12-13 00:00:00+00:00   689.070007   689.070007   695.719971   677.640015
 1996-12-16 00:00:00+00:00   673.919983   673.919983   686.969971   667.710022
 1996-12-17 00:00:00+00:00   663.349976   663.349976   680.090027   660.390015
 ...                                ...          ...          ...          ...
 2024-10-17 00:00:00+00:00  2609.300049  2609.300049  2622.709961  2603.520020
 2024-10-18 00:00:00+00:00  2593.820068  2593.820068  2618.320068  2587.959961
 2024-10-21 00:00:00+00:00  2604.919922  2604.919922  2618.709961  2594.050049
 2024-10-22 00:00:00+00:00  2570.699951  2570.699951  2604.159912  2564.459961
 2024-10-23 00:00:00+00:00  2599.620117  2599.620117  2607.790039  2567.419922

 Price                             Open  Volume
 Date
 1996-12-11 00:00:00+00:00   705.989990   28000
 1996-12-12 00:00:00+00:00   705.109985   25900
 1996-12-13 00:00:00+00:00   690.440002   26500
 1996-12-16 00:00:00+00:00   686.969971   22800
 1996-12-17 00:00:00+00:00   675.349976   31600
 ...                                ...     ...
 2024-10-17 00:00:00+00:00  2620.739990  331300
 2024-10-18 00:00:00+00:00  2616.040039  265200
 2024-10-21 00:00:00+00:00  2600.770020  240700
 2024-10-22 00:00:00+00:00  2600.870117  343300
 2024-10-23 00:00:00+00:00  2575.250000  345962

 [6864 rows x 6 columns],
 'IBM': Price                       Adj Close       Close        High         Low  \
 Date
 1962-01-02 00:00:00+00:00    1.513320    7.291268    7.374124    7.291268
 1962-01-03 00:00:00+00:00    1.526550    7.355003    7.355003    7.291268
 1962-01-04 00:00:00+00:00    1.511336    7.281708    7.355003    7.278521
 1962-01-05 00:00:00+00:00    1.481573    7.138305    7.272148    7.125558
 1962-01-08 00:00:00+00:00    1.453793    7.004461    7.131931    6.947100
 ...                               ...         ...         ...         ...
 2024-10-16 00:00:00+00:00  233.669998  233.669998  233.880005  231.119995
 2024-10-17 00:00:00+00:00  232.880005  232.880005  233.149994  230.660004
 2024-10-18 00:00:00+00:00  232.199997  232.199997  232.649994  230.169998
 2024-10-21 00:00:00+00:00  231.750000  231.750000  232.419998  230.259995
 2024-10-22 00:00:00+00:00  232.250000  232.250000  232.970001  230.669998

 Price                            Open   Volume
 Date
 1962-01-02 00:00:00+00:00    7.374124   407940
 1962-01-03 00:00:00+00:00    7.291268   305955
 1962-01-04 00:00:00+00:00    7.355003   274575
 1962-01-05 00:00:00+00:00    7.272148   384405
 1962-01-08 00:00:00+00:00    7.131931   572685
 ...                               ...      ...
 2024-10-16 00:00:00+00:00  232.110001  2846700
 2024-10-17 00:00:00+00:00  232.000000  5040100
 2024-10-18 00:00:00+00:00  231.919998  4715700
 2024-10-21 00:00:00+00:00  231.210007  2733300
 2024-10-22 00:00:00+00:00  231.990005  3172600

 [15810 rows x 6 columns],
 'AAPL': Price                       Adj Close       Close        High         Low  \
 Date
 1980-12-12 00:00:00+00:00    0.098943    0.128348    0.128906    0.128348
 1980-12-15 00:00:00+00:00    0.093781    0.121652    0.122210    0.121652
 1980-12-16 00:00:00+00:00    0.086898    0.112723    0.113281    0.112723
 1980-12-17 00:00:00+00:00    0.089049    0.115513    0.116071    0.115513
 1980-12-18 00:00:00+00:00    0.091630    0.118862    0.119420    0.118862
 ...                               ...         ...         ...         ...
 2024-10-16 00:00:00+00:00  231.779999  231.779999  232.119995  229.839996
 2024-10-17 00:00:00+00:00  232.149994  232.149994  233.850006  230.520004
 2024-10-18 00:00:00+00:00  235.000000  235.000000  236.179993  234.009995
 2024-10-21 00:00:00+00:00  236.479996  236.479996  236.850006  234.449997
 2024-10-22 00:00:00+00:00  235.860001  235.860001  236.220001  232.600006

 Price                            Open     Volume
 Date
 1980-12-12 00:00:00+00:00    0.128348  469033600
 1980-12-15 00:00:00+00:00    0.122210  175884800
 1980-12-16 00:00:00+00:00    0.113281  105728000
 1980-12-17 00:00:00+00:00    0.115513   86441600
 1980-12-18 00:00:00+00:00    0.118862   73449600
 ...                               ...        ...
 2024-10-16 00:00:00+00:00  231.600006   34082200
 2024-10-17 00:00:00+00:00  233.429993   32993800
 2024-10-18 00:00:00+00:00  236.179993   46431500
 2024-10-21 00:00:00+00:00  234.449997   36254500
 2024-10-22 00:00:00+00:00  233.889999   38512600

 [11057 rows x 6 columns],
 'GOOGL': Price                       Adj Close       Close        High         Low  \
 Date
 2004-08-19 00:00:00+00:00    2.504808    2.511011    2.604104    2.401401
 2004-08-20 00:00:00+00:00    2.703765    2.710460    2.729730    2.515015
 2004-08-23 00:00:00+00:00    2.730975    2.737738    2.839840    2.728979
 2004-08-24 00:00:00+00:00    2.617892    2.624374    2.792793    2.591842
 2004-08-25 00:00:00+00:00    2.646101    2.652653    2.702703    2.599600
 ...                               ...         ...         ...         ...
 2024-10-16 00:00:00+00:00  165.160004  165.160004  165.800003  163.740005
 2024-10-17 00:00:00+00:00  162.929993  162.929993  166.369995  162.759995
 2024-10-18 00:00:00+00:00  163.419998  163.419998  164.710007  163.080002
 2024-10-21 00:00:00+00:00  164.070007  164.070007  164.500000  162.619995
 2024-10-22 00:00:00+00:00  165.139999  165.139999  165.770004  162.979996

 Price                            Open     Volume
 Date
 2004-08-19 00:00:00+00:00    2.502503  893181924
 2004-08-20 00:00:00+00:00    2.527778  456686856
 2004-08-23 00:00:00+00:00    2.771522  365122512
 2004-08-24 00:00:00+00:00    2.783784  304946748
 2004-08-25 00:00:00+00:00    2.626627  183772044
 ...                               ...        ...
 2024-10-16 00:00:00+00:00  164.529999   16406000
 2024-10-17 00:00:00+00:00  165.729996   21453400
 2024-10-18 00:00:00+00:00  163.190002   19757700
 2024-10-21 00:00:00+00:00  162.949997   20946500
 2024-10-22 00:00:00+00:00  162.979996   16171900

 [5079 rows x 6 columns],
 'MSFT': Price                       Adj Close       Close        High         Low  \
 Date
 1986-03-13 00:00:00+00:00    0.059946    0.097222    0.101563    0.088542
 1986-03-14 00:00:00+00:00    0.062087    0.100694    0.102431    0.097222
 1986-03-17 00:00:00+00:00    0.063158    0.102431    0.103299    0.100694
 1986-03-18 00:00:00+00:00    0.061552    0.099826    0.103299    0.098958
 1986-03-19 00:00:00+00:00    0.060482    0.098090    0.100694    0.097222
 ...                               ...         ...         ...         ...
 2024-10-16 00:00:00+00:00  416.119995  416.119995  416.359985  410.480011
 2024-10-17 00:00:00+00:00  416.720001  416.720001  422.500000  415.589996
 2024-10-18 00:00:00+00:00  418.160004  418.160004  419.649994  416.260010
 2024-10-21 00:00:00+00:00  418.779999  418.779999  418.959991  413.750000
 2024-10-22 00:00:00+00:00  427.510010  427.510010  430.579987  418.040009

 Price                            Open      Volume
 Date
 1986-03-13 00:00:00+00:00    0.088542  1031788800
 1986-03-14 00:00:00+00:00    0.097222   308160000
 1986-03-17 00:00:00+00:00    0.100694   133171200
 1986-03-18 00:00:00+00:00    0.102431    67766400
 1986-03-19 00:00:00+00:00    0.099826    47894400
 ...                               ...         ...
 2024-10-16 00:00:00+00:00  415.170013    15508900
 2024-10-17 00:00:00+00:00  422.359985    14820000
 2024-10-18 00:00:00+00:00  417.140015    17145300
 2024-10-21 00:00:00+00:00  416.119995    14206100
 2024-10-22 00:00:00+00:00  418.489990    24625100

 [9731 rows x 6 columns],
 'TSLA': Price                       Adj Close       Close        High         Low  \
 Date
 2010-06-29 00:00:00+00:00    1.592667    1.592667    1.666667    1.169333
 2010-06-30 00:00:00+00:00    1.588667    1.588667    2.028000    1.553333
 2010-07-01 00:00:00+00:00    1.464000    1.464000    1.728000    1.351333
 2010-07-02 00:00:00+00:00    1.280000    1.280000    1.540000    1.247333
 2010-07-06 00:00:00+00:00    1.074000    1.074000    1.333333    1.055333
 ...                               ...         ...         ...         ...
 2024-10-16 00:00:00+00:00  221.330002  221.330002  222.820007  218.929993
 2024-10-17 00:00:00+00:00  220.889999  220.889999  222.080002  217.899994
 2024-10-18 00:00:00+00:00  220.699997  220.699997  222.279999  219.229996
 2024-10-21 00:00:00+00:00  218.850006  218.850006  220.479996  215.729996
 2024-10-22 00:00:00+00:00  217.970001  217.970001  218.220001  215.259995

 Price                            Open     Volume
 Date
 2010-06-29 00:00:00+00:00    1.266667  281494500
 2010-06-30 00:00:00+00:00    1.719333  257806500
 2010-07-01 00:00:00+00:00    1.666667  123282000
 2010-07-02 00:00:00+00:00    1.533333   77097000
 2010-07-06 00:00:00+00:00    1.333333  103003500
 ...                               ...        ...
 2024-10-16 00:00:00+00:00  221.399994   49632800
 2024-10-17 00:00:00+00:00  221.589996   50791800
 2024-10-18 00:00:00+00:00  220.710007   49611900
 2024-10-21 00:00:00+00:00  218.899994   47329000
 2024-10-22 00:00:00+00:00  217.309998   43054600

 [3604 rows x 6 columns]}

In [19]:
# 종가 데이터를 추출하여 DataFrame 생성
price = pd.DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
price

# 상관계수 계산
price_corr = price.corr()
price_corr

          ^KS11       IBM      AAPL     GOOGL      MSFT      TSLA
^KS11  1.000000  0.852148  0.722645  0.815326  0.683060  0.821418
IBM    0.852148  1.000000  0.718863  0.728847  0.721156  0.471351
AAPL   0.722645  0.718863  1.000000  0.976825  0.988753  0.926383
GOOGL  0.815326  0.728847  0.976825  1.000000  0.982374  0.900297
MSFT   0.683060  0.721156  0.988753  0.982374  1.000000  0.889371
TSLA   0.821418  0.471351  0.926383  0.900297  0.889371  1.000000

### 예제 9
1. 2~3행에서 '0'컬럼을 None으로 변경 하시오.
2. 0~2행에서 '2'컬럼을 None으로 변경하시오.
3. 각 컬럼의 None값들을 각 컬럼의 평균값으로 채우시오.

In [ ]:
# 예제 9.1 2~3행에서 '0'컬럼을 None으로 변경 하시오.

In [ ]:
# 예제 9.2 0~2행에서 '2'컬럼을 None으로 변경하시오.

In [ ]:
# 예제 9.3 각 컬럼의 None값들을 각 컬럼의 평균값으로 채우시오.

### 예제 10
1. multi_idx 이름으로 0 ~ 20의 값을 갖는 (5,4) 데이터 프레임을 생성하시오.
  - index 상위 색인: a, a, b, b, c
  - index 하위 색인: 1,2, 1, 2, 1
  - columns 상위 색인: 'KOR', 'KOR', 'USA', 'USA'
  - columns 하위 색인: 'Seoul', 'Busan', 'LA', 'NewYork'
2. index=b, column= KOR의 Seoul에 해당하는 값을 출력하시오.

In [ ]:
# 예제 10.1

In [ ]:
# 예제 10.2

### 예제 11
1. 위 데이터프레임에 index(key1, key2), column(Country, Region)의 이름을 설정하시오.
2. 2번째 index로 데이터 프레임을 정렬 하시오.
3. column의 레벨을 바꾸시오.

In [ ]:
# 예제 11.1

In [ ]:
# 예제 11.2

In [ ]:
# 예제 11.3

---

In [ ]:
# end of file